In [1]:
import numpy as np
import pandas as pd

In [2]:
data={'year':[2010, 2011, 2012, 2011, 2012, 2010, 2011, 2012],
     'team':['Bears','Bears','Bears','Packers','Packers','Lions','Lions','Lions'],
     'wins':[11,8,10,15,11,6,10,4],
     'losses':[5,6,8,1,5,10,6,12]}

print(data)

In [3]:
df=pd.DataFrame(data)
print(df)

   losses     team  wins  year
0       5    Bears    11  2010
1       6    Bears     8  2011
2       8    Bears    10  2012
3       1  Packers    15  2011
4       5  Packers    11  2012
5      10    Lions     6  2010
6       6    Lions    10  2011
7      12    Lions     4  2012

In [4]:
df.dtypes

losses     int64
team      object
wins       int64
year       int64
dtype: object

In [5]:
df.describe()

          losses       wins         year
count   8.000000   8.000000     8.000000
mean    6.625000   9.375000  2011.125000
std     3.377975   3.377975     0.834523
min     1.000000   4.000000  2010.000000
25%     5.000000   7.500000  2010.750000
50%     6.000000  10.000000  2011.000000
75%     8.500000  11.000000  2012.000000
max    12.000000  15.000000  2012.000000

In [6]:
df.head()

   losses     team  wins  year
0       5    Bears    11  2010
1       6    Bears     8  2011
2       8    Bears    10  2012
3       1  Packers    15  2011
4       5  Packers    11  2012

In [7]:
df.tail()

   losses     team  wins  year
3       1  Packers    15  2011
4       5  Packers    11  2012
5      10    Lions     6  2010
6       6    Lions    10  2011
7      12    Lions     4  2012

In [8]:
################ANOTHER EXAMPLE####################

In [32]:
    countries = ['Russian Fed.', 'Norway', 'Canada', 'United States',\
                 'Netherlands', 'Germany', 'Switzerland', 'Belarus',\
                 'Austria', 'France', 'Poland', 'China', 'Korea', \
                 'Sweden', 'Czech Republic', 'Slovenia', 'Japan',\
                 'Finland', 'Great Britain', 'Ukraine', 'Slovakia',\
                 'Italy', 'Latvia', 'Australia', 'Croatia', 'Kazakhstan']

    gold = [13, 11, 10, 9, 8, 8, 6, 5, 4, 4, 4, 3, 3, 2, 2, 2, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0]
    silver = [11, 5, 10, 7, 7, 6, 3, 0, 8, 4, 1, 4, 3, 7, 4, 2, 4, 3, 1, 0, 0, 2, 2, 2, 1, 0]
    bronze = [9, 10, 5, 12, 9, 5, 2, 1, 5, 7, 1, 2, 2, 6, 2, 4, 3, 1, 2, 1, 0, 6, 2, 1,'NaN', 1]

data={'country_name': pd.Series(countries),'gold': pd.Series(gold),\
      'silver': pd.Series(silver),'bronze': pd.Series(bronze)}
df2=pd.DataFrame(data)

In [33]:
df2.head()

  bronze   country_name  gold  silver
0      9   Russian Fed.    13      11
1     10         Norway    11       5
2      5         Canada    10      10
3     12  United States     9       7
4      9    Netherlands     8       7

In [34]:
cllist=list(df2)

In [35]:
cllist[0],cllist[1]=cllist[1],cllist[0]

In [36]:
df3=df2.loc[:,cllist]

In [37]:
df3.head()

    country_name bronze  gold  silver
0   Russian Fed.      9    13      11
1         Norway     10    11       5
2         Canada      5    10      10
3  United States     12     9       7
4    Netherlands      9     8       7

In [39]:
df3.describe() #Bronze has a NaN value

            gold     silver
count  26.000000  26.000000
mean    3.807692   3.730769
std     3.826426   3.105578
min     0.000000   0.000000
25%     1.000000   1.250000
50%     2.500000   3.000000
75%     5.750000   5.750000
max    13.000000  11.000000